# 리스트의 값 중 최대값/최소값 반환
# minMax

score = [90,78,81,64,99]
print('최대값: ',max(score))
print('최소값: ',min(score))
print('-------------------------------------------------')

chr = ['b','A','e','C']
print('최대값: ',max(chr))
print('최소값: ',min(chr))
print('-------------------------------------------------')

x=['banana','apple','Coconut','Melon']
print('최대값: ',max(x))
print('최소값: ',min(x))

print('정렬: ',sorted(x)) #첫글자 기준으로 정렬
# utf-8 코드값 : A (65) < a(97)
print('-------------------------------------------------')

print('점수:',score)
print('합계:',sum(score))
print('-------------------------------------------------')