# 예제 1
for i in range(2):
    print("Welcome! (%d)" % (i+1))

print("----------------------------------------")

# 예제 2
for name in ["홍길동", "이몽룡", "성춘향", "변학도"]:
    print(name)

print("----------------------------------------")

# 예제 3
for i in range(0,3):
    print(i)

print("----------------------------------------")


# 정해진 횟수만큼 반복하는 반복문
# 형식 : for 변수 in 리스트/범위 :
#             반복문
for name in ['apple', 'banana', 'melon'] :
    print(name)
print("----------------------------------------")
# range(시작값, 끝값+1)
# range(끝값+1) : 0~끝값
# range(시작값, 끝값+1, 간격) : 시작값부터 끝값까지 간격만큼 띄어서 출력
for num in range(10) : #0~9까지 (총 10개)
    print(num)
print("----------------------------------------")
for num in range(1,10) : #1~9까지 (총 9개)
    print(num)
print("----------------------------------------")
for num in range(1, 10, 2):  # 1~9까지 2 간격으로 출력
    print(num)
print("----------------------------------------")
for num in [1,3,5,7,9] : #리스트 사용
    print(num)
print("----------------------------------------")
for num in range(10, 0, -2):  # 10에서 1까지 -2 간격으로 출력
    print(num)
print("----------------------------------------")

